import { Component } from '@angular/core';
import { FormBuilder, Validators } from '@angular/forms';


@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})


export class AppComponent {
  currency = '$';


  productsData = [
    {
      img: '1',
      title: 'Лучшие друзья',
      descr: 'Печенье, с которого все началось! Наше фирменное печенье с шоколадной крошкой и грецкими орехами хрустящее снаружи с достаточно толстой и липкой серединкой.',
      price: 20,
      basePrice: 20,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '2',
      title: 'Шоколадный француз',
      descr: 'Это печенье, изготовленное из тёмного французского какао и полусладкой шоколадной стружки, наверняка удовлетворит даже самого заядлого любителя шоколада.',
      price: 24,
      basePrice: 24,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '3',
      title: 'Овсянка с изюмом, Сэр!',
      descr: 'Это сдобное маслянистое печенье весом шесть унций каждое, золотисто-коричневое снаружи, влажное внутри и наполненное пухлым сладким изюмом.',
      price: 18,
      basePrice: 18,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '4',
      title: 'Шоколадное наслаждение',
      descr: 'Идеально хрустящее снаружи и достаточно густое и липкое в центре, это печенье наполнено полусладкой и тёмной шоколадной стружкой, придающей богатую глубину вкуса.',
      price: 24,
      basePrice: 24,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '5',
      title: 'Арахисовый рай',
      descr: 'Сладкое, пикантное и идеально сбалансированное печенье удовлетворяет тягу любителей арахисового масла и шоколада.',
      price: 20,
      basePrice: 20,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '6',
      title: 'Шоколадный ореховый деликатес',
      descr: 'Наша фирменная рецептура печенья с шоколадными крошками и грецкими орехами гарантирует незабываемый вкусовой опыт. Каждое печенье хрустит снаружи, но раскрывает внутри нежную сердцевину.',
      price: 18,
      basePrice: 18,
      weight: '2 шт./ 200 гр.',
    },
    {
      img: '7',
      title: 'Ассорти фирменного печенья',
      descr: 'Зачем выбирать один, когда можно получить их все? Наш классический ассортимент печенья включает в себя по одному из четырёх оригинальных вкусов печенья.',
      price: 36,
      basePrice: 36,
      weight: '4 шт./ 400 гр.',
    },
    {
      img: '8',
      title: 'Лимонное печенье',
      descr: 'Весна уже не за горами, но нам не терпелось подарить вам немного солнечного света: наше первое лимонное печенье. Это лакомство жевательное, лимонное, не слишком сладкое и даже немного… освежающее?',
      price: 33,
      basePrice: 33,
      weight: '4 шт./ 400 гр.',
    },
    {
      img: '9',
      title: 'Любители шоколада',
      descr: 'Вам больше не нужно выбирать фаворитов. Мы сделали этот набор для всех людей, которые действительно любят шоколад…',
      price: 38,
      basePrice: 38,
      weight: '4 шт./ 400 гр.',
    },
    {
      img: '10',
      title: 'Карамель и кокос',
      descr: 'Побалуйте себя кокосовым, маслянистым, карамельным печеньем, которое обладает невиданным ранее вкусом и текстурой. Наслаждение круглый год.',
      price: 33,
      basePrice: 33,
      weight: '4 шт./ 400 гр.',
    },
    {
      img: '11',
      title: 'Веганское с шоколадной крошкой',
      descr: 'Наше веганское безглютеновое печенье содержит кусочки хрустящих грецких орехов и полусладкую веганскую шоколадную стружку.',
      price: 39,
      basePrice: 39,
      weight: '4 шт./ 400 гр.',
    },
    {
      img: '12',
      title: 'Крем-брюле ореховое печенье',
      descr: 'Используя уникальную смесь ингредиентов, мы создали печенье с кусочками крем-брюле и миндальными орехами, которое обещает неповторимые гастрономические ощущения. Каждый кусочек обладает хрустящей корочкой и тает во рту.',
      price: 35,
      basePrice: 35,
      weight: '4 шт./ 400 гр.',
    },
  ];


  form = this.fb.group({
    product: ['', Validators.required],
    name: ['', Validators.required],
    phone: ['', Validators.required],
  });

  constructor(private fb: FormBuilder) {}


  scrollTo(target: HTMLElement) {
    target.scrollIntoView({ behavior: 'smooth' });
  }


  changeCurrency() {
    let newCurrency = '$';
    let coefficient = 1;

    if (this.currency === '$') {
      newCurrency = '₽';
      coefficient = 90;
    } else if (this.currency === '₽') {
      newCurrency = 'BYN';
      coefficient = 3;
    } else if (this.currency === 'BYN') {
      newCurrency = '€';
      coefficient = 0.9;
    } else if (this.currency === '€') {
      newCurrency = '¥';
      coefficient = 6.9;
    }
    this.currency = newCurrency;

    this.productsData.forEach((item: any) => {
      item.price = +(item.basePrice * coefficient).toFixed(1);
    });
  }


  confirmOrder() {
    if (this.form.valid) {
      alert('Спасибо за заказ! Мы скоро свяжемся с вами!');
      this.form.reset();
    }
  }
}
